#!/usr/bin/env python
# coding: utf-8

# In[ ]:


# 

# Напишите программу:
# Тимофей обычно спит ночью X часов и устраивает себе днем тихий час на Y минут. 
# Определите, сколько всего минут Тимофей спит в сутки.

a = int(input())
b = int(input())
c = a*60 + b
print(c)

